---
kind: type
id: T:Autodesk.Revit.DB.CitySet
source: html/9184332e-1167-a3c1-b2c1-58e9409817f3.htm
---
# Autodesk.Revit.DB.CitySet

An set that contains cities.

## Syntax (C#)
```csharp
public class CitySet : APIObject, IEnumerable
```